000100200402          Dcl-Pr DayNumName Char(9);
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000400181112
000401210407          Dcl-Pr MonthNumName Char(9);
000402210407           MonthIn Packed(2);
000403210407          End-Pr;
