000001210209     A          R CINFO
000002210209     A                                  2 31'Cohort Recomendation'
000003210209     A                                  4 17'Risk Factor Cohort'
000004210209     A                                  6 15'9.5 - 99.9 Group 1'
000005210209     A                                  7 15'5.5 -  9.4 Group 2'
000006210209     A                                  8 15'3.5 -  5.4 Group 3'
000007210209     A                                  9 15'1.5 -  3.4 Group 4'
000008210209     A                                 10 15'0.0 -  1.4 Group 5'
000009210209     A                                 12  6'Health care and front line workers-
000010210209     A                                       will be in either Group 1 or Group-
000011210209     A                                       2'
000012210209     A                                      DSPATR(RI)
000100      
