000100210417         DCL-F UPDREPORT  PRINTER OflInd(*IN01);
000101210417         DCL-F SHIFTWEEK DISK USAGE(*INPUT) KEYED RENAME(SHIFTWEEK:SHIFTWEEKR);
000102210417         DCL-F SHIFTRATES DISK USAGE(*INPUT)      RENAME(SHIFTRATES:SHIFTRATER);
000103210417         DCL-F WORKWEEK1 DISK USAGE(*INPUT)      RENAME(WORKWEEK1:WORKWEEKR);
000104210417         DCL-F EMPLOYEE2 DISK(*EXT) KEYED  USAGE(*UPDATE : *OUTPUT : *DELETE);
000105210417
000106210417        // DCL-F PAYRPT2 PRINTER OFLIND(*IN01);
000107210417         DCL-F VIEWEMP WORKSTN;
000108210417
000109210417         DCL-S HOURSOVER PACKED(3);
000110210417
000111210417         DCL-PI
000112210417           MAIN EXTPGM('UPDATEEMP');
000113210417           EMPNUMINP ZONED(12);
000114210417         END-PI;
000115210417
000116210417
000117210417
000118210417
000119210417
000120210417
000121210417         DCL-DS WORKWEEK1DS;
000122210417               WORKSHIFT;
000123210417               HRSWORKED;
000124210417               EMPNUM;
000129210417         End-Ds WORKWEEK1Ds;
000130210417
000131210417         DCL-DS EMPLOYEE2DS;
000132210417               EMPNUM;
000133210417               PAYGRADE;
000134210417               FIRSTNAME;
000135210417               LASTNAME;
000136210417               PHONE;
000137210417               CITY;
000138210417               ADDRESS;
000139210417               YTDPAY;
000140210417               YTDTAX;
000141210417               UNIONDUES;
000142210417         End-Ds EMPLOYEE2Ds;
000143210417
000144210417
000145210417                   READ      WORKWEEK1;
000146210417                   DOW       NOT %EOF;
000147210417
000148210417
000149210417                      CHAIN %KDS(EMPNUMINP) EMPLOYEE2;
000150210417
000151210417
000152210417                      SELECT;
000153210417                        WHEN      %FOUND(EMPLOYEE2);
000154210417                          FIRSTNAMEN = FIRSTNAME;
000155210417                          LASTNAMEN = LASTNAME;
000156210417                          PhoneN = %Dec(Phone:10:0);
000157210417                          CITYN= CITY;
000158210417                          ADDRESSN=ADDRESS;
000159210417
000160210417                        SELECT;
000161210417                           WHEN WORKSHIFT = 'A';
000162210417                                WORKSHIFTN = 'Afternoon';
000163210417                           WHEN WORKSHIFT = 'D';
000164210417                                WORKSHIFTN = 'Day';
000165210417                           WHEN WORKSHIFT = 'N';
000166210417                                WORKSHIFTN = 'Night';
000167210417                        ENDSL;
000168210417
000169210417                        WHEN NOT %FOUND(EMPLOYEE2);
000172210417                              EXSR ERROR;
000173210417
000174210417                        WHEN %ERROR;
000175210417                              EXSR ERROR;
000176210417                        ENDSL;
000177210417
000178210417
000179210417                        IF *IN01 = *ON;
000180210417
000181210417                          *IN01 = *OFF;
000182210417                        ENDIF;
000183210417
000184210417                        READ      WORKWEEK1;
000185210417                   ENDDO;
000186210417                   *INLR = *ON;
000187210417                   RETURN;
000188210417         BEGSR  ADDREC;
000189210417                EMPLOYEE2DS = WORKWEEK1DS;
000190210417                Phone = %Dec(TPhone:10:0);
000191210417                WRITE SALESTFR;
000192210417         ENDSR;
000193210417
000194210417         BEGSR  CHGREC;
000195210417                EMPLOYEE2DS = WORKWEEK1DS;
000196210417                Phone = %Dec(TPhone:10:0);
000197210417                UPDATE SALESTFR;
000198210417         ENDSR;
000199210417
000200210417         BEGSR  DELREC;
000201210417                   DELETE    SALESTFR;
000202210417         ENDSR;
000203210417         BEGSR  ERROR;
000204210417                   TFNAME = 'UPDATE/DELETE/CHANGE';
000205210417                   TLNAME = 'E R R O R';
000206210417         ENDSR;
000207210417
000208210417
000209210417
000210210417
000211210417
000212210417
000213210417
000214210417         READ SHIFTRATES;
000215210421
000217210417         READ SHIFTWEEK;
000218210417
000219210417         DOW NOT %EOF;
000220210417           EXSR PAYSR;
000221210417           IF *IN01;
000222210421
000224210417             *IN01 = *OFF;
000225210417           ENDIF;
000226210421
000227210417             READ SHIFTWEEK;
000228210417         ENDDO;
000229210417
000230210417             TOTWKPAY = TOTREGPAY + TOTOVTPAY;
000231210421
000232210417             EXFMT EMPDATA;
000233210417             *INLR = *ON;
000234210417             RETURN;
000235210417
000236210417         BEGSR PAYSR;
000237210417             SELECT;
000238210417               WHEN WORKSHIFT = '1';
000239210417                 HOURLYRATE = DAYHRS;
000240210417               WHEN WORKSHIFT = '2';
000241210417                 HOURLYRATE = AFTHRS;
000242210417               WHEN WORKSHIFT = '3';
000243210417                 HOURLYRATE = NIGHTHRS;
000244210417             ENDSL;
000245210417
000246210417             SELECT;
000247210417               WHEN PAYCLASS = 1;
000248210417                 EVAL(H) HOURLYRATE = HOURLYRATE * 1.094;
000249210417               WHEN PAYCLASS = 2;
000250210417                 EVAL(H) HOURLYRATE = HOURLYRATE * 1.062;
000251210417               WHEN PAYCLASS = 3;
000252210417                 EVAL(H) HOURLYRATE = HOURLYRATE * 0.957;
000253210417               WHEN PAYCLASS = 4;
000254210417                 EVAL(H) HOURLYRATE = HOURLYRATE * 1.000;
000255210417             ENDSL;
000256210417
000257210417             HOURSOVER = HRSWORKED - 40;
000258210417
000259210417             SELECT;
000260210417               WHEN HOURSOVER > 0;
000261210417                 EVAL(H) OVERPAY = HOURLYRATE * 1.5 * HOURSOVER;
000262210417                 EVAL REGULARPAY = 40 * HOURLYRATE;
000263210417                 OTHER;
000264210417                   EVAL REGULARPAY = HRSWORKED * HOURLYRATE;
000265210417                   OVERPAY = 0;
000266210417             ENDSL;
000267210417
000268210417             WEEKLYPAY = REGULARPAY + OVERPAY;
000269210417
000270210417             TOTREGPAY = TOTREGPAY + REGULARPAY;
000271210417             TOTOVTPAY = TOTOVTPAY + OVERPAY;
000272210417
000273210417         ENDSR;
000274210417
000275210417
