000100210126**FREE
000200210205       DCL-F COVIDDSP5 WORKSTN;
000300210126
000400210126       EXSR CLEAR;
000500210126       EXFMT RISKFACTOR;
000600210126
000700210126       DOW NOT(*IN03);
000800210126          IF Gender = ' ';
000900210126            *IN95 = *ON;
001000210126            EXFMT RISKFACTOR;
001100210126            *IN95 = *OFF;
001200210126            ITER;
001300210126          ELSEIF CVDISEASE = ' ';
001400210126            *IN96 = *ON;
001500210126            EXFMT RISKFACTOR;
001600210126            *IN96 = *OFF;
001700210126            ITER;
001800210126          ELSEIF DIABETES = ' ';
001900210126            *IN97 = *ON;
002000210126            EXFMT RISKFACTOR;
002100210126            *IN97 = *OFF;
002200210126            ITER;
002300210126          ELSEIF RSPDISEASE = ' ';
002400210126            *IN98 = *ON;
002500210126            EXFMT RISKFACTOR;
002600210126            *IN98 = *OFF;
002700210126            ITER;
002800210126          ELSEIF HBPRESSURE = ' ';
002900210126            *IN99 = *ON;
003000210126            EXFMT RISKFACTOR;
003100210126            *IN99 = *OFF;
003200210126            ITER;
003300210126          ELSE;
003400210126            EXSR DetermineRisk;
003500210126            TOTALQ = TOTALQ + 1;
003600210126            *IN60 = *ON;
003700210126            write RISKFACTOR;
003800210126            exfmt RISKASSMNT;
003900210126            *IN60 = *OFF;
004000210126
004100210126          ENDIF;
004200210126
004300210126          IF *IN03 = *OFF;
004400210126            EXSR CLEAR;
004500210126            EXFMT RISKFACTOR;
004600210126          ENDIF;
004700210126
004800210126       ENDDO;
004900210126
005000210126         *INLR = *ON;
005100210126         RETURN;
005200210126
005300210126       BEGSR DetermineRisk;
005400210126         AGE = 25;
005500210126         FRATE = 0.051;
005600210126         COHORT = 'Group 4';
005700210126       ENDSR;
005800210126
005900210126       BEGSR CLEAR;
006000210126         *IN95 = *OFF;
006100210126         *IN96 = *OFF;
006200210126         *IN97 = *OFF;
006300210126         AGE = 0;
006400210126         GENDER = ' ';
006500210126         HBPRESSURE = ' ';
006600210126         CVDISEASE = ' ';
006700210126         DIABETES = ' ';
006800210126         RSPDISEASE = ' ';
006900210126       ENDSR;
