000100210209**FREE
000200210209       DCL-F COVIDDSP7 WORKSTN;
000202210209       DCL-F COVIDINFO WORKSTN;
000203210209       DCL-S AGE1 int(5);
000300210126
000400210126       EXSR CLEAR;
000500210126       EXFMT RISKFACTOR;
000600210126
000700210126       DOW NOT(*IN03);
000800210126          IF Gender = ' ';
000900210126            *IN95 = *ON;
001000210126            EXFMT RISKFACTOR;
001100210126            *IN95 = *OFF;
001200210126            ITER;
001300210126          ELSEIF CVDISEASE = ' ';
001400210126            *IN96 = *ON;
001500210126            EXFMT RISKFACTOR;
001600210126            *IN96 = *OFF;
001700210126            ITER;
001800210126          ELSEIF DIABETES = ' ';
001900210126            *IN97 = *ON;
002000210126            EXFMT RISKFACTOR;
002100210126            *IN97 = *OFF;
002200210126            ITER;
002300210126          ELSEIF RSPDISEASE = ' ';
002400210126            *IN98 = *ON;
002500210126            EXFMT RISKFACTOR;
002600210126            *IN98 = *OFF;
002700210126            ITER;
002800210126          ELSEIF HBPRESSURE = ' ';
002900210126            *IN99 = *ON;
003000210126            EXFMT RISKFACTOR;
003100210126            *IN99 = *OFF;
003200210126            ITER;
003300210126          ELSE;
003400210126            EXSR DetermineRisk;
003500210126            TOTALQ = TOTALQ + 1;
003600210126            *IN60 = *ON;
003700210126            write RISKFACTOR;
003800210126            exfmt RISKASSMNT;
003801210209            If *IN01 = *ON;
003802210209              Exfmt CINFO;
003803210209              WRITE RISKFACTOR;
003804210209              EXFMT RISKASSMNT;
003805210207            ENDIF;
003900210126            *IN60 = *OFF;
004000210126
004100210126          ENDIF;
004200210126
004300210126          IF *IN03 = *OFF;
004400210126            EXSR CLEAR;
004500210126            EXFMT RISKFACTOR;
004600210126          ENDIF;
004700210126
004800210126       ENDDO;
004900210126
005000210126         *INLR = *ON;
005100210126         RETURN;
005200210126
005300210126       BEGSR DetermineRisk;
005400210209         AGE1 = %Diff(%Date():BirthDate:*Y);
005401210209         IF AGE1 > 999;
005402210209           AGE = 999;
005403210209           ELSE;
005404210209             AGE = AGE1;
005406210209         ENDIF;
005407210209
005408210209         SELECT;
005409210209           WHEN AGE >= 80;
005410210209             FRATE = 14.800;
005411210209           WHEN AGE >= 70;
005412210209             FRATE = 8.000;
005413210209           WHEN AGE >= 60;
005414210209             FRATE = 3.600;
005415210209           WHEN AGE >= 50;
005416210209             FRATE = 1.300;
005417210209           WHEN AGE >= 40;
005418210209             FRATE = 0.400;
005419210209           WHEN AGE >= 30;
005420210209             FRATE = 0.250;
005421210209           WHEN AGE >= 20;
005422210209             FRATE = 0.230;
005423210209           WHEN AGE >= 10;
005424210209             FRATE = 0.200;
005425210209           OTHER;
005426210209             FRATE = 0.100;
005427210209         ENDSL;
005600210209
005601210209         IF CVDISEASE = 'Y';
005602210209           FRATE += .8;
005603210209         ENDIF;
005604210209         IF DIABETES = 'Y';
005605210209           FRATE += .6;
005606210209         ENDIF;
005607210209         IF HBPRESSURE = 'Y';
005608210209           FRATE += .3;
005609210209         ENDIF;
005610210209         IF RSPDISEASE = 'Y';
005611210209           FRATE += .4;
005612210209         ENDIF;
005613210209
005614210209         IF GENDER = 'F';
005615210209           FRATE -= .05;
005616210209         ENDIF;
005617210209
005618210209         SELECT;
005619210209           WHEN FRATE > 9.4;
005620210209             COHORT = 'GROUP 1';
005621210209           WHEN FRATE > 5.4;
005622210209             COHORT = 'GROUP 2';
005623210209           WHEN FRATE > 3.4;
005624210209             COHORT = 'GROUP 3';
005625210209           WHEN FRATE > 1.4;
005626210209             COHORT = 'GROUP 4';
005627210209           OTHER;
005628210209             COHORT = 'GROUP 5';
005629210209         ENDSL;
005700210126       ENDSR;
005800210126
005900210126       BEGSR CLEAR;
006000210126         *IN95 = *OFF;
006100210126         *IN96 = *OFF;
006200210209         *IN97 = *OFF;
006301210209         CLEAR BIRTHDATE;
006400210126         GENDER = ' ';
006500210126         HBPRESSURE = ' ';
006600210126         CVDISEASE = ' ';
006700210126         DIABETES = ' ';
006800210126         RSPDISEASE = ' ';
006900210126       ENDSR;
